; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v6 - type_2 ?v8 - type_3)
 	      (pred_4 ?v2 - object ?v8 - type_3)
	      (pred_1 ?v6 - type_2 ?v4 - type_1)
	      (pred_2 ?v6 - type_2 ?v2 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v6 - type_2 ?v3 ?v1 - type_3)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_2
       :parameters (?v6 - type_2 ?v7 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v5) (pred_3 ?v6 ?v5) (pred_1 ?v6 ?v4))
       :effect (and (pred_2 ?v6 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v5)) 
		    (not (pred_1 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_2 ?v7 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v4) (pred_3 ?v6 ?v5))
       :effect (and (pred_4 ?v7 ?v5)
		    (pred_1 ?v6 ?v4)
		    (not (pred_2 ?v6 ?v7 ?v4)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_07 obj_01 - type_2
obj_03 obj_04 obj_05 obj_02 - type_1
obj_06 obj_08 obj_11 - type_3
obj_10 obj_09 - object)
(:init
(pred_3 obj_07 obj_11)
(pred_1 obj_07 obj_03)
(pred_1 obj_07 obj_04)
(pred_3 obj_01 obj_11)
(pred_1 obj_01 obj_05)
(pred_1 obj_01 obj_02)
(pred_4 obj_10 obj_06)
(pred_4 obj_09 obj_08)
)
(:goal
(and
(pred_4 obj_10 obj_11)
(pred_4 obj_09 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_06)))
)
)

; plan
1. (op_3 obj_01 obj_11 obj_06)
   deleted: (pred_3 obj_01 obj_11)
   added: (pred_3 obj_01 obj_06)
   goals met: 1 of 2
2. (op_2 obj_01 obj_10 obj_06 obj_02)
   deleted: (pred_4 obj_10 obj_06) (pred_1 obj_01 obj_02)
   added: (pred_2 obj_01 obj_10 obj_02)
   goals met: 1 of 2
3. (op_3 obj_01 obj_06 obj_11)
   deleted: (pred_3 obj_01 obj_06)
   added: (pred_3 obj_01 obj_11)
   goals met: 1 of 2
4. (op_1 obj_01 obj_10 obj_11 obj_02)
   deleted: (pred_2 obj_01 obj_10 obj_02)
   added: (pred_4 obj_10 obj_11) (pred_1 obj_01 obj_02)
   goals met: 2 of 2
